Конфигурация отчетов/InformationRegisters/СостояниеАктивностиПринтеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостояниеАктивностиПринтеров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУдачныхПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Локация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Локации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/CommonModules/ВнешнееВзаимодействие/Ext/Module.bsl
// Функция для выполнения пинга указанного адреса с 4 попытками
// Параметры:
//   Адрес - строка, IP-адрес или доменное имя для пинга
// Возвращаемое значение:
//   Структура:
//     - Успех - Булево, Истина если хотя бы одна попытка успешна
//     - КоличествоУдачныхПопыток - Число, количество успешных попыток (0-4)
Функция Пинг(Адрес) Экспорт
    // Инициализация структуры результата
    Результат = Новый Структура("Успех, КоличествоУдачныхПопыток", Ложь, 0);
    
    Попытка
        // Создаем объект WScript.Shell для выполнения системных команд
        ОбъектShell = Новый COMОбъект("WScript.Shell");
        
        // Счетчик удачных попыток
        КоличествоУдачных = 0;
        
        // Выполняем 4 попытки пинга
        Для НомерПопытки = 1 По 4 Цикл
            // Формируем команду для пинга (Windows)
            Команда = "ping -n 1 " + Адрес; // -n 1 означает один запрос
            
            // Выполняем команду и скрываем окно (0 - скрытое окно, Истина - ожидать завершения)
            КодВозврата = ОбъектShell.Run(Команда, 0, Истина);
            
            // Проверяем код возврата (0 - успех)
            Если КодВозврата = 0 Тогда
                КоличествоУдачных = КоличествоУдачных + 1;
            КонецЕсли;
        КонецЦикла;
        
        // Заполняем структуру результатов
        Результат.Успех = (КоличествоУдачных > 0);
        Результат.КоличествоУдачныхПопыток = КоличествоУдачных;
        
        Возврат Результат;
        
    Исключение
        // Обработка ошибок
        Сообщить("Ошибка при выполнении пинга: " + ОписаниеОшибки());
        Возврат Результат;
    КонецПопытки;
КонецФункции


Процедура ЗаписьАктивностьОбрудования_В_Регистр(Оборудование, Статус, УдачныеПопытки) Экспорт 

	Запись = РегистрыСведений.СостояниеАктивностиПринтеров.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.Оборудование = Оборудование;
    Запись.Статус = Статус;
    Запись.КоличествоУдачныхПопыток = УдачныеПопытки;

    Попытка
        Запись.Записать(Истина);
		//Сообщить("Родитель задачи успешно обновлен!");
    Исключение
        Сообщить("Ошибка при записи в родителя Задачи: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры
